fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафиков/ВКМ_ЗаполнениеГрафиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнениеГрафиков</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>Выходные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикиРаботы/ВКМ_ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиРаботы</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выходной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафиков/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьГрафикРаботы(Команда) Экспорт
	
	// Проверка на клиенте через БСП
	Если Не ЗначениеЗаполнено(Объект.ГрафикРаботы) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выберите график работы!'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выберите месяц заполнения!'"));
		Возврат;
	КонецЕсли;

	ЗаполнитьГрафикРаботыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьГрафикРаботыНаСервере()
	
	ДатаНачала = НачалоМесяца(Объект.Период);
	ДатаКонца  = КонецМесяца(Объект.Период);
	
	// Блок с Набор.Отбор удален, так как он вызывал ошибку несоответствия типов
	
	ТекущаяДата = ДатаНачала;
	
	Пока ТекущаяДата <= ДатаКонца Цикл
		
		// Менеджер записи сам найдет существующую строку по ключу (График + Дата) 
		// и обновит её, либо создаст новую.
		МенеджерЗаписи = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ГрафикРаботы = Объект.ГрафикРаботы;
		МенеджерЗаписи.Дата         = ТекущаяДата;
		
		НомерДняНедели = ДеньНедели(ТекущаяДата);
		ЭтоВыходной = (НомерДняНедели >= 6); 
		
		МенеджерЗаписи.Выходной = ЭтоВыходной;
		
		Если ЭтоВыходной Тогда
			МенеджерЗаписи.Значение = 0;
		Иначе
			МенеджерЗаписи.Значение = 8;
		КонецЕсли;
		
		МенеджерЗаписи.Записать();
		
		ТекущаяДата = ТекущаяДата + 86400; // +1 день
		
	КонецЦикла;
	
	// Формируем сообщение через БСП
	ТекстГрафика = Строка(Объект.ГрафикРаботы);
	ТекстПериода = Формат(ДатаНачала, "ДФ='MMMM yyyy'");
	ТекстСообщения = СтрШаблон(НСтр("ru = 'График ""%1"" на %2 успешно заполнен.'"), ТекстГрафика, ТекстПериода);
		
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры

#КонецОбласти
